; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v9 ?v7)
             (pred_7 ?v5 ?v4)
             (pred_9 ?v9 ?v4)
             (pred_11 ?v8 ?v9 )
	     (pred_6 ?v9)
             (pred_10 ?v1)
             (pred_3 ?v5)
             (pred_2 ?v4)
             (pred_5 ?v9)
             (pred_1 ?v5)
             (pred_8 ?v9)
             (pred_12 ))



(:action op_2
:parameters (?v11 ?v10 ?v3 ?v2)
:precondition (and (pred_10 ?v11) (pred_10 ?v10) (pred_3 ?v3) (pred_2 ?v2)
          (pred_4 ?v11 ?v10) (pred_7 ?v3 ?v2)
                   (pred_9 ?v10 ?v2) (pred_6 ?v11) 
                   (pred_5 ?v10) (pred_1 ?v3))
:effect (and  (pred_8 ?v10) (not (pred_5 ?v10))))


(:action op_5
:parameters (?v11 ?v6)
:precondition (and (pred_10 ?v11) (pred_10 ?v6)
               (pred_6 ?v11) (pred_4 ?v11 ?v6) (pred_8 ?v6))
:effect (and (pred_6 ?v6) (not (pred_6 ?v11))))

(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_10 ?v11) (pred_3 ?v3) 
                  (pred_6 ?v11) (pred_11 ?v3 ?v11) (pred_12 ))
:effect (and (pred_1 ?v3)
   (not (pred_11 ?v3 ?v11)) (not (pred_12 ))))


(:action op_3
:parameters (?v11 ?v12 ?v13)
:precondition (and (pred_10 ?v11) (pred_3 ?v12) (pred_3 ?v13)
                  (pred_6 ?v11) (pred_1 ?v13) (pred_11 ?v12 ?v11))
:effect (and (pred_1 ?v12) (pred_11 ?v13 ?v11)
        (not (pred_1 ?v13)) (not (pred_11 ?v12 ?v11))))

(:action op_1
:parameters (?v11 ?v3)
:precondition (and (pred_10 ?v11) (pred_3 ?v3) 
                  (pred_6 ?v11) (pred_1 ?v3))
:effect (and (pred_12 ) (pred_11 ?v3 ?v11) (not (pred_1 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_13 obj_08 obj_16 obj_17 obj_07 obj_10 obj_05 obj_03 obj_06 obj_11 obj_18 obj_15 obj_01 obj_12 obj_20
    obj_02 obj_04
    obj_09 obj_14
    )

    (:init
       (pred_12)

       (pred_10 obj_19)
       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_10 obj_16)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_05)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_18)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_10 obj_12)
       (pred_10 obj_20)
       (pred_2 obj_02)
       (pred_2 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_14)

       (pred_4 obj_19 obj_17)
       (pred_4 obj_19 obj_13)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_13 obj_08)
       (pred_4 obj_13 obj_19)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_08 obj_13)
       (pred_4 obj_16 obj_05)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_17 obj_03)
       (pred_4 obj_17 obj_07)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_07 obj_10)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_17)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_05)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_07)
       (pred_4 obj_05 obj_18)
       (pred_4 obj_05 obj_16)
       (pred_4 obj_05 obj_10)
       (pred_4 obj_03 obj_15)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_03 obj_17)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_06 obj_11)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_11 obj_12)
       (pred_4 obj_11 obj_18)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_11 obj_06)
       (pred_4 obj_18 obj_20)
       (pred_4 obj_18 obj_05)
       (pred_4 obj_18 obj_11)
       (pred_4 obj_15 obj_01)
       (pred_4 obj_15 obj_03)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_01 obj_15)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_12 obj_11)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_20 obj_18)
       (pred_4 obj_20 obj_12)
       (pred_5 obj_07)
       (pred_5 obj_19)
       (pred_9  obj_07 obj_02)
       (pred_9  obj_19 obj_04)
       (pred_8 obj_13)
       (pred_8 obj_08)
       (pred_8 obj_16)
       (pred_8 obj_17)
       (pred_8 obj_10)
       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_18)
       (pred_8 obj_15)
       (pred_8 obj_01)
       (pred_8 obj_12)
       (pred_8 obj_20)

       (pred_7  obj_09 obj_02)
       (pred_7  obj_14 obj_04)
       (pred_11 obj_09 obj_13)
       (pred_11 obj_14 obj_03)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_11 obj_09 obj_20)
    ))
(:constraints
  (always (not (pred_6 obj_11)))
)
)

; plan
1. (op_4 obj_03 obj_14)
   deleted: (pred_11 obj_14 obj_03) (pred_12)
   added: (pred_1 obj_14)
   goals met: 0 of 1
2. (op_5 obj_03 obj_17)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_17)
   goals met: 0 of 1
3. (op_2 obj_17 obj_19 obj_14 obj_04)
   deleted: (pred_5 obj_19)
   added: (pred_8 obj_19)
   goals met: 0 of 1
4. (op_5 obj_17 obj_19)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_13)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_13)
   goals met: 0 of 1
6. (op_3 obj_13 obj_09 obj_14)
   deleted: (pred_1 obj_14) (pred_11 obj_09 obj_13)
   added: (pred_1 obj_09) (pred_11 obj_14 obj_13)
   goals met: 0 of 1
7. (op_5 obj_13 obj_08)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_08)
   goals met: 0 of 1
8. (op_5 obj_08 obj_16)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_16)
   goals met: 0 of 1
9. (op_5 obj_16 obj_05)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_05)
   goals met: 0 of 1
10. (op_5 obj_05 obj_18)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_18)
   goals met: 0 of 1
11. (op_5 obj_18 obj_20)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_20)
   goals met: 0 of 1
12. (op_1 obj_20 obj_09)
   deleted: (pred_1 obj_09)
   added: (pred_12) (pred_11 obj_09 obj_20)
   goals met: 1 of 1
